from .client import WrenClient

__all__ = ["WrenClient"]

try:
    from .langchain_llm import WrenChat
    __all__.append("WrenChat")
except Exception:
    pass


from rich.console import Console

console = Console()

if __name__ != "__main__":
    console.print(r"""
############################################################
#                                                          #
#   ██╗    ██╗██████╗ ███████╗███╗   ██╗                   #
#   ██║    ██║██╔══██╗██╔════╝████╗  ██║                   #
#   ██║ █╗ ██║██████╔╝█████╗  ██╔██╗ ██║                   #
#   ██║███╗██║██╔══██╗██╔══╝  ██║╚██╗██║                   #
#   ╚███╔███╔╝██║  ██║███████╗██║ ╚████║                   #
#    ╚══╝╚══╝ ╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝                   #
#                                                          #
#                                                          #
#                Team Carrick_Ball                         #
#                                                          #
############################################################
""", style="bold orange1")